{
  "blogs": [
    {
      "id": "2d76",
      "title": "Forest Gump - 1994",
      "body": "“Life is like a box of chocolates. You never know what you’re gonna get.”\n\nThere’s something disarmingly simple about Forrest Gump, and yet it speaks to people in a deeply profound way. Through the eyes of Forrest — kind, slow-witted, but emotionally rich — we witness decades of American history. But more importantly, we see what it means to live with an open heart.\n\nWhat struck me most wasn’t just Forrest’s journey, but the people around him. Jenny, whose life is filled with trauma. Lieutenant Dan, who learns to find meaning beyond despair. This film reminded me that everyone’s timeline is different, and that success isn’t always loud or visible. Sometimes, it’s in simply showing up — loving, forgiving, continuing.",
      "author": "şahin"
    },
    {
      "id": "45af",
      "title": "La La Land - 2016",
      "body": "“Here’s to the fools who dream.”\n\nYes, it’s a musical. Yes, it’s full of color and song. But La La Land is also about compromise, timing, and the paths we don’t take. Watching Mia and Sebastian chase their dreams — together, then apart — reminded me how love and ambition don’t always grow in the same direction.\n\nThe final scene broke me in the best way. That “what could’ve been” fantasy — it felt so real. Sometimes two people meet at the wrong time. And that’s not failure. That’s life.\n\nLa La Land is about more than romance or music. It’s about the dreams we follow, the ones we leave behind, and the beauty in both.",
      "author": "vildan"
    },
    {
      "id": "c648",
      "title": "The Fault In Our Stars - 2014",
      "body": "“Some infinities are bigger than other infinities.”\n\nYes, it’s a teen romance. But The Fault in Our Stars is also about love in the face of death — and how something doesn’t have to last forever to be unforgettable.\n\nHazel and Gus are young, sick, and full of life. Their relationship feels real because it isn’t perfect. It’s messy, funny, painful. And when it ends, you’re left with the weight of what it meant — not how long it lasted.\n\nIt reminded me that we don’t control how much time we have with people. But we do control what we do with that time. And sometimes, even a short story can leave the deepest mark.\n\n",
      "author": "firaz"
    },
    {
      "id": "cfa4",
      "title": "The Wolf of Wall Street - 2013",
      "body": "When I first watched The Wolf of Wall Street, I laughed. I was shocked. I was entertained — maybe even a little seduced by it. It’s a film that grabs you from the very first line and doesn’t let go. But after the laughter faded and the adrenaline wore off, something else remained: a strange discomfort. And I think that’s what makes it brilliant.\n\nBecause The Wolf of Wall Street is not just a movie about drugs, sex, and money. It’s a mirror — and whether we like what it reflects or not is up to us. Directed by Martin Scorsese and based on the real-life memoir of Jordan Belfort, the film tells the story of a young, ambitious stockbroker who climbs his way to the top of Wall Street — not through hard work and integrity, but through manipulation, lies, and endless indulgence.\n\nLeonardo DiCaprio’s performance as Jordan is electrifying. He’s charming, energetic, and utterly convincing as a man who knows how to sell dreams — even if they’re built on nothing. We watch as he turns a tiny brokerage firm into a multi-million-dollar empire. We watch him lie, cheat, and get away with it — over and over again.\n\nAnd strangely, for much of the movie, we enjoy watching it. That’s what’s so dangerous — and clever — about this story.\n",
      "author": "vildan"
    },
    {
      "id": "6f56",
      "title": "Titanic - 1997",
      "body": "\"You jump, I jump, remember?\"\n\nYes, it’s a blockbuster. Yes, it’s been quoted, parodied, and memed to death. But Titanic remains one of the most emotionally effective films ever made — and not just because of the love story.\n\nWhat hit me hardest was the inevitability of it all. You know the ship will sink. You know thousands will die. And yet, in the middle of that doomed voyage, there is love, rebellion, and the rediscovery of self. Rose, trapped in a life designed for her, finds freedom in the most unexpected way: through love, through risk, through letting go.\n\nTitanic isn’t just about a disaster. It’s about the things we choose to live for, even when we know time is short.",
      "author": "şahin"
    }
  ]
}